olonsoft/esp8266-weatherstation/src/PersonalWeatherStation.cpp
#include <Arduino.h>

#include <ESP8266WiFi.h>
#include <DNSServer.h>
#include <ESP8266WebServer.h>
#include <WiFiManager.h>
#include <WiFiClientSecure.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266httpUpdate.h>
#include <TimeLib.h>
#include <WiFiUdp.h>
#include <Ticker.h>
#include "Accounts.h"

#include <SPI.h>                  // this is needed for BME280 library
#include <BME280I2C.h>            // by Tyler Glenn https://github.com/finitespace/BME280
#include <Wire.h>                 // Needed for legacy versions of Arduino.

#define UPDATE_CHECK_INTERVAL 300 // FOTA update interval
#define AVERAGE_GUST_INTERVAL 3   // calc average gust every 3 seconds and uses the max of these measurements. https://www.wmo-sat.info/oscar/variables/view/205
#define REPORT_DATA_INTERVAL 600  // report every X seconds
#define REPORT_TIMES_PER_HOUR 6   //
#define CUP_CIRCUMFERENCE 1       // in meters. Experiment with this value (0.67 * 1.5)
#define READ_DIR_INTERVAL 1       // read wind direction sensor every 1 sec to calc average
#define CLOCK_SYNC_INTERVAL 3600  // update clock every X seconds
#define USE_SERIAL Serial
#define DEBOUNCE_DELAY 10         // 10 ms

String projectName = "anemometer";
String currentVersion = "1.0.23";
#define SENDTOSITE // if commented, will not post to sites.

const int httpsPort = 443;
const int httpPort = 80;

//thingspeak
const char* postSite1 = "api.thingspeak.com";
String postData1 = "/update?key=%ThingspeakKey&field1=%temp&field2=%hum&field3=%pres&field4=%dew&field5=%heatIdx&field6=%wSpeed&field7=%wGust&field8=%wDir";
const char* ThingspeakSHA1 = "78:60:18:44:81:35:BF:DF:77:84:D4:0A:22:0D:9B:4E:6C:DC:57:2C";

// weatherundergound
const char* postSite2 = "weatherstation.wunderground.com";
String postData2 = "/weatherstation/updateweatherstation.php?ID=%WUndergroundID&PASSWORD=%WUndergroundPSW&dateutc=now&winddir=%wDir&windspeedmph=%wSpeed&windgustmph=%wGust&tempf=%temp&baromin=%pres&dewptf=%dew&humidity=%hum&rainin=%hRain&softwaretype=esp8266&action=updateraw";
const char* WUndergroundSHA1 = "12:DB:BB:24:8E:0F:6F:D4:63:EC:45:DD:5B:ED:37:D7:6F:B1:5F:E5";

//PWSweather.com
const char* postSite3 = "www.pwsweather.com";
String postData3 = "/pwsupdate/pwsupdate.php?ID=%PWSweatherID&PASSWORD=%PWSweatherPSW&dateutc=%now&winddir=%wDir&windspeedmph=%wSpeed&windgustmph=%wGust&tempf=%temp&baromin=%pres&dewptf=%dew&humidity=%hum&rainin=%hRain&softwaretype=esp8266&action=updateraw";
const char* PWSweatherSHA1 = "74:3C:4F:DD:3E:8E:51:40:B4:28:79:7D:6A:B4:30:FE:4A:56:10:BE";

const char* postSite4 = "www.studio19.gr";
String postData4 = "/weather/post.php?id=%MySiteID&psw=%MySitePSW&temp=%temp&hum=%hum&pressure=%pres&heatindex=%heatIdx&dewpoint=%dew&windspeed=%wSpeed&windgust=%wGust&winddir=%wDir&windchill=%wChill&rain=%hRain&dayrain=%dRain";
//const char* postSite4 = "139.91.162.84";
// String postData4 = "/html/ws/post.php?id=%MySiteID&psw=%MySitePSW&temp=%temp&hum=%hum&pressure=%pres&heatindex=%heatIdx&dewpoint=%dew&windspeed=%wSpeed&windgust=%wGust&winddir=%wDir&windchill=%wChill&rain=%hRain&dayrain=%dRain";


// variables for ntp time
static const char ntpServerName[] = "pool.ntp.org";
const int timeZone = 0;     // Central European Time (UTC = 0)
WiFiUDP Udp;
unsigned int localPort = 8888;  // local port to listen for UDP packets
time_t getNtpTime();
void sendNTPpacket(IPAddress &address);

Ticker tickerUpdateCheck;
Ticker tickerGustTimer;
Ticker tickerReadDirection;
Ticker tickerClockSync;
Ticker tickerReportData;

bool doUpdateCheck = true;
bool doReadDirection = true;
bool doClockSync = true;
bool doCalcGustAverage = false;
bool doReportData = false;

BME280I2C bme;                // Default : forced mode, standby time = 1000 ms
                              // Oversampling = pressure ×1, temperature ×1, humidity ×1, filter off,
bool metric = true;
float temp(NAN), hum(NAN), pres(NAN);
uint8_t pressureUnit(1);    // unit: B000 = Pa, B001 = hPa, B010 = Hg, B011 = atm, B100 = bar, B101 = torr, B110 = N/m^2, B111 = psi

// wind variables
#define PIN_WINDSPEED 14
#define PIN_RAINPIN 12
#define PIN_CLEAR 13

float windSpeed = 0.0f;
float tmpWindSpeed = 0.0f;
volatile unsigned int windSpeedSamplesCount = 0;

float windGust = 0.0f;
float tmpWindGust = 0.0f;
volatile unsigned int windGustSamplesCount = 0;

float windPeak = 0.0f;
unsigned long windSpeedLastIntTime = 0;
unsigned long windSpeedStartSampleTime = 0;
unsigned int periodsCount = 0;

int windDir = 0;
float dewPoint = NAN;
float heatIndex = NAN;
float windChill = NAN;

volatile int currentRainCount = 0;
float currentRain = 0.0f;
int hourRainCount = 0;
int hourRainArray[60] = {};
float hourRain = 0.0f;
int dayRainCount = 0;
int dayRainArray[24] = {};
float dayRain = 0.0f;

unsigned long rainLastIntTime = 0 ;
unsigned long count1h = 0;
unsigned long count1d = 0;


void enableUpdateCheck() {
  doUpdateCheck = true;
}

void enableReadDirection(){
  doReadDirection = true;
}

void enableClockSync() {
  doClockSync = true;
}

void enableCalcGustAverage() {
  doCalcGustAverage = true;
}

void enableReportData() {
  doReportData = true;
}

float convertCtoF(float c) {
  return c * 1.8f + 32;
}

float convertFtoC(float f) {
  return (f - 32) * 0.55555f;
}

void restartIfNotConnected() {
  if (!WiFi.isConnected()) {
    USE_SERIAL.println("Not Connected to WiFi. Rebooting...");
    //reset and try again,
    ESP.restart();
    delay(1000);
    }
}
// check http://stackoverflow.com/questions/41371156/esp8266-and-post-request

void send2site(const char* host, String data) {

  WiFiClient client;
  USE_SERIAL.print("connecting to ");
  USE_SERIAL.println(host);
  if (!client.connect(host, httpPort)) {
    USE_SERIAL.println("connection failed");
    return;
  }

  USE_SERIAL.print("requesting URL: ");
  USE_SERIAL.println(data);

  client.print(String("GET ") + data + " HTTP/1.1\r\n" +
               "Host: " + host + "\r\n" +
               "User-Agent: ESP8266\r\n" +
               "Connection: close\r\n\r\n");

  USE_SERIAL.println("request sent");

	delay(10);

