olonsoft/esp8266-weatherstation/src/PersonalWeatherStation.cpp
	while (client.connected()) {
    String line = client.readStringUntil('\n');
		line += ("\r\n");
		USE_SERIAL.print(line);
  }
  USE_SERIAL.println("closing connection");
}

void send2siteSecure(const char* host, const char* fingerprint, String data) {

// Use WiFiClientSecure class to create TLS connection
  WiFiClientSecure client;
  USE_SERIAL.print("connecting to ");
  USE_SERIAL.println(host);
  if (!client.connect(host, httpsPort)) {
    USE_SERIAL.println("connection failed");
    return;
  }

  if (client.verify(fingerprint, host)) {
    USE_SERIAL.println("certificate matches");
  } else {
    USE_SERIAL.println("certificate doesn't match");
  }

  USE_SERIAL.print("requesting URL: ");
  USE_SERIAL.println(data);

  client.print(String("GET ") + data + " HTTP/1.1\r\n" +
               "Host: " + host + "\r\n" +
               "User-Agent: ESP8266\r\n" +
               "Connection: close\r\n\r\n");

  USE_SERIAL.println("request sent");

	delay(10);

	while (client.connected()) {
    String line = client.readStringUntil('\n');
		line += ("\r\n");
		USE_SERIAL.print(line);
  }
  USE_SERIAL.println("closing connection");
}

/*
void send2site(String site, String fingerprint, String data) {
  if (WiFi.isConnected()) {
	  HTTPClient http;
	  http.begin(site, fingerprint);
	  http.addHeader("Content-Type", "application/x-www-form-urlencoded");
	  int httpCode = http.POST(data);
	  // httpCode will be negative on error
	  if (httpCode > 0) {
		// HTTP header has been send and Server response header has been handled
		USE_SERIAL.printf("[HTTP] POST/GET code: %d\n", httpCode);

		// file found at server
		if (httpCode == HTTP_CODE_OK) {
		  String payload = http.getString();
		  USE_SERIAL.println(payload);
		}
	  } else {
		USE_SERIAL.printf("[HTTP] POST/GET... failed, error: %s\n", http.errorToString(httpCode).c_str());
	  }
	  http.writeToStream(&Serial);
	  http.end();
  }
}
*/

void windSpeedPinInterrupt() {
  if (windSpeedLastIntTime == 0){
    windSpeedLastIntTime = windSpeedStartSampleTime = millis();
    return;
  }
  unsigned long _timeSpan = millis() - windSpeedLastIntTime;
  windSpeedLastIntTime = millis();
  //Serial.println(thisTime);
  if (_timeSpan > DEBOUNCE_DELAY) { //debouncing

    windSpeedSamplesCount++;
    windGustSamplesCount++;

    float _speed = (CUP_CIRCUMFERENCE / 1000.0f) / (_timeSpan / 3600000.0f);
    //Serial.print("<>Speed: "); Serial.println(_speed);
    tmpWindSpeed += _speed;
    tmpWindGust += _speed;

    if (windPeak < _speed) windPeak = _speed;
  } else Serial.println("Debounce ");
}

void rainPinInterrupt() {
  unsigned long thisTime =  micros() - rainLastIntTime;
  rainLastIntTime = micros();
  //Serial.println(thisTime);
  if (thisTime > 1000) { //debouncing
    currentRainCount++;
  }
}

float totalRain(float rainValue) {
  static float rainValues[REPORT_TIMES_PER_HOUR] = {};
  float total = 0;
  for (int i = 0; i < REPORT_TIMES_PER_HOUR-1; i++) {
    rainValues[i] = rainValues[i+1];
    total += rainValues[i];
  }
  rainValues[REPORT_TIMES_PER_HOUR-1]=rainValue;
  total += rainValue;
  return total;
}

void enableInterrupts() {
  attachInterrupt(PIN_WINDSPEED, windSpeedPinInterrupt, FALLING);
  attachInterrupt(PIN_RAINPIN, rainPinInterrupt, FALLING);
}

void disableInterrupts() {
  detachInterrupt(PIN_WINDSPEED);
  detachInterrupt(PIN_RAINPIN);
}

bool wakeUp() {
  USE_SERIAL.print("Waking Up: ");
  if (!WiFi.isConnected()) {
    //disableInterrupts();
    WiFi.forceSleepWake();
    int i = 0;
    while (!WiFi.isConnected() & (i++ < 20)) {
      USE_SERIAL.print("w");
      delay(1000);
    }
  }
  //enableInterrupts();
  USE_SERIAL.println();
  return WiFi.isConnected();
}

bool updateCheck() {
  bool updateFlag = false;
  String latestVersion = "";
  if (WiFi.isConnected()) {
	  USE_SERIAL.println("Update: Checking for new firmware. Current version: " + currentVersion);
    HTTPClient upd;
    USE_SERIAL.println("Update: Connecting to update site: " + updateSite );
    // configure traged server and url
    String file2Load = updateSite + projectName + ".txt";
    USE_SERIAL.println("Update: File to load: " + file2Load);
    upd.begin(file2Load); //HTTP
    // start connection and send HTTP header
    int httpCode = upd.GET();

    // httpCode will be negative on error
    if (httpCode > 0) {
      // HTTP header has been send and Server response header has been handled
      USE_SERIAL.printf("Update: [HTTP] GET result code: %d\n", httpCode);

      // file found at server
      if (httpCode == HTTP_CODE_OK) {
        latestVersion = upd.getString();
        USE_SERIAL.println("Update: Found version No: <" + latestVersion + ">");
        if (latestVersion != currentVersion) {
          USE_SERIAL.println("Update: Modified version found");
          updateFlag = true;
        } else USE_SERIAL.println("Update: No new version found");
      }
    } else {
      USE_SERIAL.printf("Update: [HTTP] GET... failed, error: %s\n", upd.errorToString(httpCode).c_str());
    }

    upd.end();
  }

  if (updateFlag) {
    updateFlag = false;
    USE_SERIAL.println("Update: Trying to update version <" + currentVersion + "> to version: <" + latestVersion + ">");
    delay(1000);
    t_httpUpdate_return ret = ESPhttpUpdate.update(updateSite + projectName + ".bin");

    switch(ret) {
        case HTTP_UPDATE_FAILED:
            USE_SERIAL.printf("Update: HTTP_UPDATE_FAILED Error (%d): %s", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
            break;

        case HTTP_UPDATE_NO_UPDATES:
            USE_SERIAL.println("Update: HTTP_UPDATE_NO_UPDATES");
            break;

        case HTTP_UPDATE_OK:
            USE_SERIAL.println("Update: HTTP_UPDATE_OK");
            updateFlag = true;
            break;
    }
  }
  return updateFlag;
}

int voltage2degrees(int v)
{
  // following values are working with esp8266
  if (v > 920) return 270;  // W
  if (v > 850) return 315;  // NW
  if (v > 780) return 0;    // N
  if (v > 630) return 225;  // SW
  if (v > 500) return 45;   // NE
  if (v > 300) return 180;  // S
  if (v > 200)  return 135; // SE
  if (v > 90)  return 90;   // E
  return 0;
}

int avgWindDir(int windDirection)
{
  const int ARYSIZE = 10;     // number of elements in arrays
  const double DEG2RAD = M_PI / 180.0; // convert degrees to radian
  static double dirNorthSouth[ARYSIZE];
  static double dirEastWest[ARYSIZE];
  static int c = 0; // array counter

  if ( c == ARYSIZE )
  { c = 0; }

  windDirection = windDirection + 1; // convert range from 0-359 to 1 to 360

  dirNorthSouth[c] = cos(windDirection * DEG2RAD);
  dirEastWest[c++] = sin(windDirection * DEG2RAD);

  // Get array totals
  double sumNorthSouth = 0.0;
  double sumEastWest =   0.0;
  int i;
  for (i = 0; i < ARYSIZE; i++)
  {
    sumNorthSouth += dirNorthSouth[i];
    sumEastWest   += dirEastWest[i];
  }
  sumEastWest = (sumEastWest/(double) ARYSIZE);
  sumNorthSouth = (sumNorthSouth/(double) ARYSIZE);
  // use atan2() with average vector
  double avgWindDir;
  avgWindDir = atan2(sumEastWest, sumNorthSouth);
  avgWindDir = avgWindDir / DEG2RAD;  // convert radians back to degrees

  if ( avgWindDir < 0 )
  { avgWindDir += 360; }

  int avgWindDirection = (int)avgWindDir % 360; // atan2() result can be > 360, so use modulus to just return remainder
  if (avgWindDirection > 0) {                   // just in case it's 0
    avgWindDirection = avgWindDirection - 1;    // convert range back to 0-359
  }
  return avgWindDirection;
}

