olonsoft/esp8266-weatherstation/src/PersonalWeatherStation.cpp
float windChillFactor(float _temperature, float _windspeed, bool isCelcius){
  float _windChill = NAN;
  if (!isnan(_temperature)) {
    if (isCelcius) {
      if ( (_temperature <= 10.0f) && (_windspeed > 4.8f) ) {    //celcius & km/h
        _windChill = 13.12f + 0.6215f * _temperature -
                     11.37f * pow(_windspeed, 0.16f) +
                    0.3965f * _temperature * pow(_windspeed, 0.16f);
      }
    }
    else if ((_temperature <= 50.0f) && (_windspeed > 3.0f)) {     // fahrenheit & miles/h
      _windChill = 35.74f + 0.6215f * _temperature -
                   35.75f * pow(_windspeed, 0.16f) +
                  0.4275f * _temperature * pow(_windspeed, 0.16f);
    }
  }
  return _windChill;
}

float calculateHeatIndex(float temperature, float percentHumidity, bool isCelcius) {
  // Using both Rothfusz and Steadman's equations
  // http://www.wpc.ncep.noaa.gov/html/heatindex_equation.shtml
  if (isnan(temperature) || isnan(percentHumidity)) return NAN;
  float hi;

  if (isCelcius)
    temperature = convertCtoF(temperature);

  hi = 0.5 * (temperature + 61.0 + ((temperature - 68.0) * 1.2) + (percentHumidity * 0.094));

  if (hi > 79) {
    hi = -42.379 +
             2.04901523 * temperature +
            10.14333127 * percentHumidity +
            -0.22475541 * temperature*percentHumidity +
            -0.00683783 * pow(temperature, 2) +
            -0.05481717 * pow(percentHumidity, 2) +
             0.00122874 * pow(temperature, 2) * percentHumidity +
             0.00085282 * temperature*pow(percentHumidity, 2) +
            -0.00000199 * pow(temperature, 2) * pow(percentHumidity, 2);

    if((percentHumidity < 13) && (temperature >= 80.0) && (temperature <= 112.0))
      hi -= ((13.0 - percentHumidity) * 0.25) * sqrt((17.0 - abs(temperature - 95.0)) * 0.05882);

    else if((percentHumidity > 85.0) && (temperature >= 80.0) && (temperature <= 87.0))
      hi += ((percentHumidity - 85.0) * 0.1) * ((87.0 - temperature) * 0.2);
  }

  return isCelcius ? convertFtoC(hi) : hi;
}

//------------- date and time functions

/*-------- NTP code ----------*/

const int NTP_PACKET_SIZE = 48; // NTP time is in the first 48 bytes of message
byte packetBuffer[NTP_PACKET_SIZE]; //buffer to hold incoming & outgoing packets

time_t getNtpTime()
{
  if (WiFi.isConnected()) {
    IPAddress ntpServerIP; // NTP server's ip address

    while (Udp.parsePacket() > 0) ; // discard any previously received packets
    USE_SERIAL.println("Transmit NTP Request");
    // get a random server from the pool
    WiFi.hostByName(ntpServerName, ntpServerIP);
    USE_SERIAL.print(ntpServerName);
    USE_SERIAL.print(": ");
    USE_SERIAL.println(ntpServerIP);
    sendNTPpacket(ntpServerIP);
    uint32_t beginWait = millis();
    while (millis() - beginWait < 1500) {
      int size = Udp.parsePacket();
      if (size >= NTP_PACKET_SIZE) {
        USE_SERIAL.println("NTP Response Received");
        Udp.read(packetBuffer, NTP_PACKET_SIZE);  // read packet into the buffer
        unsigned long secsSince1900;
        // convert four bytes starting at location 40 to a long integer
        secsSince1900 =  (unsigned long)packetBuffer[40] << 24;
        secsSince1900 |= (unsigned long)packetBuffer[41] << 16;
        secsSince1900 |= (unsigned long)packetBuffer[42] << 8;
        secsSince1900 |= (unsigned long)packetBuffer[43];
        return secsSince1900 - 2208988800UL + timeZone * SECS_PER_HOUR;
      }
    }
    USE_SERIAL.println("No NTP Response :-(");
  }
  return 0; // return 0 if unable to get the time
}

// send an NTP request to the time server at the given address
void sendNTPpacket(IPAddress &address) {
  if (WiFi.isConnected()) {
    // set all bytes in the buffer to 0
    memset(packetBuffer, 0, NTP_PACKET_SIZE);
    // Initialize values needed to form NTP request
    // (see URL above for details on the packets)
    packetBuffer[0] = 0b11100011;   // LI, Version, Mode
    packetBuffer[1] = 0;     // Stratum, or type of clock
    packetBuffer[2] = 6;     // Polling Interval
    packetBuffer[3] = 0xEC;  // Peer Clock Precision
    // 8 bytes of zero for Root Delay & Root Dispersion
    packetBuffer[12] = 49;
    packetBuffer[13] = 0x4E;
    packetBuffer[14] = 49;
    packetBuffer[15] = 52;
    // all NTP fields have been given values, now
    // you can send a packet requesting a timestamp:
    Udp.beginPacket(address, 123); //NTP requests are to port 123
    Udp.write(packetBuffer, NTP_PACKET_SIZE);
    Udp.endPacket();
  }
}

String TwoDigitNumber(int n) {
  if (n>=0 && n<10)
    return '0' + String(n);
  else
    return String(n);
}

String Time2Str() {
   //return = string.format("%04d/%02d/%02d %02d:%02d:%02d", year(), month(), day(), hour(), minute(), second());
   return String(year()) + "-" + TwoDigitNumber(month()) + "-" + TwoDigitNumber(day())+" "+TwoDigitNumber(hour())+":"+TwoDigitNumber(minute())+":" + TwoDigitNumber(second());
}

String URLEncode2(const char* msg) {
    const char *hex = "0123456789abcdef";
    String encodedMsg = "";

    while (*msg!='\0'){
        if( ('a' <= *msg && *msg <= 'z')
                || ('A' <= *msg && *msg <= 'Z')
                || ('0' <= *msg && *msg <= '9') ) {
            encodedMsg += *msg;
        } else {
            encodedMsg += '%';
            encodedMsg += hex[*msg >> 4];
            encodedMsg += hex[*msg & 15];
        }
        msg++;
    }
    return encodedMsg;
}

String Value2String(int y){
  return !isnan(y) ? String(y) : "";
}

String Value2String(float y){
  return !isnan(y) ? String(y) : "";
}

String CreateURL(String postS) {
  String s = postS;

  s.replace("%ThingspeakKey", String(ThingspeakKey));
  s.replace("%WUndergroundID", String(WUndergroundID));
  s.replace("%WUndergroundPSW", String(WUndergroundPSW));
  s.replace("%PWSweatherID", String(PWSweatherID));
  s.replace("%PWSweatherPSW", String(PWSweatherPSW));
  s.replace("%MySiteID", String(MySiteID));
  s.replace("%MySitePSW", String(MySitePSW));

  s.replace("%temp", Value2String(temp));
  s.replace("%hum", Value2String(hum));
  s.replace("%pres", Value2String(pres));
  s.replace("%dew", Value2String(dewPoint));
  s.replace("%heatIdx", Value2String(heatIndex));
  s.replace("%wSpeed", Value2String(windSpeed));
  s.replace("%wGust", Value2String(windGust));
  s.replace("%wChill", Value2String(windChill));
  s.replace("%wDir", Value2String(windDir));
  s.replace("%cRain", Value2String(currentRain));
  s.replace("%hRain", Value2String(hourRain));
  s.replace("%dRain", Value2String(dayRain));
  s.replace("%now", URLEncode2(Time2Str().c_str()));
  return s;
}

void updateDateTime() {
  USE_SERIAL.print(F("Sync clock..."));
  Udp.begin(localPort);
  setTime(getNtpTime());
  USE_SERIAL.println(Time2Str());
}

void setup() {
  // put your setup code here, to run once:
  USE_SERIAL.begin(115200);
  USE_SERIAL.setDebugOutput(false);
  delay(1000);
  USE_SERIAL.println("\n\n");
  USE_SERIAL.println("Starting " + projectName + " version: " + currentVersion);

  USE_SERIAL.println();

  //USE_SERIAL.print("FlashChipSize: ");      USE_SERIAL.println(ESP.getFlashChipSize());
  USE_SERIAL.print(F("FlashChipRealSize: "));  USE_SERIAL.println(ESP.getFlashChipRealSize());
  //USE_SERIAL.print("FlashChipSizeByChipId: ");  USE_SERIAL.println(ESP.getFlashChipSizeByChipId());
  USE_SERIAL.print(F("Free Heap: "));  USE_SERIAL.println(ESP.getFreeHeap());
  USE_SERIAL.print(F("Free Sketch Size: "));  USE_SERIAL.println(ESP.getFreeSketchSpace());
  USE_SERIAL.print(F("Sketch Size: "));  USE_SERIAL.println(ESP.getSketchSize());

  USE_SERIAL.println();
  //WiFiManager
  //Local intialization. Once its business is done, there is no need to keep it around
  WiFiManager wifiManager;
  //wifiManager.setDebugOutput(false);
  //reset saved settings
  //wifiManager.resetSettings();
  USE_SERIAL.print(F("SSID: "));
  USE_SERIAL.println(WiFi.SSID());
  USE_SERIAL.print(F("PASSWORD: "));
  USE_SERIAL.println(WiFi.psk());
  //sets timeout until configuration portal gets turned off
  //useful to make it all retry or go to sleep
  //in seconds
  wifiManager.setTimeout(180);

  USE_SERIAL.println();

  //fetches ssid and pass and tries to connect
  //if it does not connect it starts an access point with the specified name
  //and goes into a blocking loop awaiting configuration
  if(!wifiManager.autoConnect(projectName.c_str())) {
    USE_SERIAL.println(F("Failed to connect to AP and hit timeout"));
    //reset and try again,
    ESP.restart();
    delay(1000);
  }

  USE_SERIAL.println();
  USE_SERIAL.println(F("Connected to WiFi."));

  USE_SERIAL.println();

  // check for updates
  updateCheck();

  USE_SERIAL.println();

