olonsoft/esp8266-weatherstation/src/PersonalWeatherStation.cpp
  //udate the time
  updateDateTime();

  USE_SERIAL.println();

  // ---------------- BME part -------------------
  USE_SERIAL.print(F("Checking for BME280 Sensor... "));
  Wire.begin(); // for BME280. Parameters are pinSDA, pinSCL Defaults are 4,5
  // try to initialize BME280 sensor
  if (bme.begin()) {
    USE_SERIAL.println(F("Found!"));
  }
  else {
    USE_SERIAL.println(F("Not found!"));
  }
  delay(1000);
  // ----------------------------------
  pinMode(PIN_WINDSPEED, INPUT);
  pinMode(PIN_RAINPIN, INPUT);
  pinMode(PIN_CLEAR, INPUT);

  enableInterrupts();

  // set updateFlag to update every
  tickerUpdateCheck.attach(UPDATE_CHECK_INTERVAL, enableUpdateCheck);
  //
  tickerReadDirection.attach(READ_DIR_INTERVAL, enableReadDirection);
  //
  tickerClockSync.attach(CLOCK_SYNC_INTERVAL, enableClockSync);

  tickerGustTimer.attach(AVERAGE_GUST_INTERVAL, enableCalcGustAverage);
  tickerReportData.attach(REPORT_DATA_INTERVAL, enableReportData);

  windSpeedStartSampleTime = millis();
  count1h = millis();
  count1d = millis();
}

// -----------------------------------------------------------------------------
// ----------------------------- main program loop -----------------------------
// -----------------------------------------------------------------------------
void loop() {

  // if Clear button is pressed, erase ssid and restart
  if (digitalRead(PIN_CLEAR) == LOW) {
    USE_SERIAL.println(F("Clear wifi and restart."));
    WiFi.disconnect();
    ESP.restart();
    delay(1000);
  }

  // --------- read direction every 1 sec to calculate average -------------
  if (doReadDirection) {
    windDir = avgWindDir(voltage2degrees(analogRead(A0)));
    doReadDirection = false;
    //Serial.println(ESP.getFreeHeap(), DEC);
    //USE_SERIAL.printf("%d-%02d-%02d %02d %02d %02d\n",
    //                  year(), month(), day(), hour(), minute(), second() );
  }

  float _speed = 0;

  if (doCalcGustAverage) {
    doCalcGustAverage = false;
    if (windGustSamplesCount > 0)
      _speed = tmpWindGust / windGustSamplesCount;
    else
      _speed = 0;
    if (windGust < _speed) windGust = _speed;
    USE_SERIAL.print("\tWindGust: "); Serial.println(_speed);
    tmpWindGust = 0;
    windGustSamplesCount = 0;
  }

  if (doReportData) {
    doReportData = false;
    USE_SERIAL.print("\tWindSamples: "); USE_SERIAL.print(windSpeedSamplesCount);
    if (windSpeedSamplesCount > 0)
      _speed = tmpWindSpeed / windSpeedSamplesCount;
    else
      _speed = 0;
    USE_SERIAL.print("\tWindSpeed: "); Serial.println(_speed);
    windSpeed = _speed;

    windSpeedSamplesCount = 0;
    tmpWindSpeed = 0;

    disableInterrupts();

    windSpeed /= 2; // we have 2 pulses / revolution   // --------<<<<<<<<<<<< don't forget this
    windGust /= 2;
    windPeak /= 2;

    currentRain = (currentRainCount * 0.2794f); // value in mm; There are 2 pulses per change <<<< test this
    hourRain = totalRain(currentRain);
    dayRain += currentRain;  // not used for the moment

    // ----------- read BME sensor data ------------------------
    bme.read(pres, temp, hum, metric, pressureUnit);        // Parameters: (float& pressure, float& temp, float& humidity, bool celsius = false, uint8_t pressureUnit = 0x0)

    windChill = windChillFactor(temp, windSpeed, metric);
    dewPoint = bme.dew(temp, hum, metric);
    heatIndex = calculateHeatIndex(temp, hum, metric);

    USE_SERIAL.println();
    USE_SERIAL.print(F("Temp: "));       USE_SERIAL.print(temp);
    USE_SERIAL.print(F(" Hum: "));       USE_SERIAL.print(hum);
    USE_SERIAL.print(F(" Pressure: "));  USE_SERIAL.print(pres);
    USE_SERIAL.print(F(" Speed: "));     USE_SERIAL.print(windSpeed);
    USE_SERIAL.print(F(" Gust: "));      USE_SERIAL.print(windGust);
    USE_SERIAL.print(F(" Peak: "));      USE_SERIAL.print(windPeak);
    USE_SERIAL.print(F(" Dir: "));       USE_SERIAL.print(windDir);
    USE_SERIAL.print(F(" Current Rain: ")); USE_SERIAL.print(currentRain);
    USE_SERIAL.print(F(" Rain/hour: ")); USE_SERIAL.print(hourRain);
    USE_SERIAL.print(F(" Rain/day: ")); USE_SERIAL.print(dayRain);
    USE_SERIAL.print(F(" WindChill: ")); USE_SERIAL.print(windChill);
    USE_SERIAL.print(F(" DewPoint: "));  USE_SERIAL.print(dewPoint);
    USE_SERIAL.print(F(" HeatIndex: ")); USE_SERIAL.println(heatIndex);


    wakeUp();
    restartIfNotConnected();

    // ----------- update the time  ------------------
    if (doClockSync) {
      //udate the time
      updateDateTime();
      doClockSync = false;
    }

    // ================= Create post data for thingspeak =======================
    String postData = CreateURL(postData1);
    USE_SERIAL.println(F("\nThingspeak post data:"));
    USE_SERIAL.println(postData);
    //#ifdef SENDTOSITE
      USE_SERIAL.println(F("Sending..."));
      send2siteSecure(postSite1, ThingspeakSHA1, postData);
    //#endif

    // ================= Post to my custom site ================================
    postData = CreateURL(postData4);
    USE_SERIAL.println(F("\nMySite post data:"));
    USE_SERIAL.println(postData);
    USE_SERIAL.println(F("Sending..."));
    send2site(postSite4, postData);

    // ==========  convert metric to farenheight for wunderground ==============
    temp = convertCtoF(temp);
    pres = 0.0295299830714f * pres; //hPa to inches
    windSpeed = 0.621371f * windSpeed; //mph
    windGust = 0.621371f * windGust; //mph
    hourRain = hourRain / 25.40f;  // rain in inches

    windChill = windChillFactor(temp, windSpeed, false);
    dewPoint = bme.dew(temp, hum, false);
    heatIndex = calculateHeatIndex(temp, hum, false);

    // ------------------------- post to wunderground --------------------------
    postData = CreateURL(postData2);
    USE_SERIAL.println("\nWUnderground post data:");
    USE_SERIAL.println(postData);
    #ifdef SENDTOSITE
      USE_SERIAL.println(F("Sending..."));
      send2siteSecure(postSite2, WUndergroundSHA1, postData);
    #endif

    // ------------------------- post to PWSweather.com --------------------------
    postData = CreateURL(postData3);
    USE_SERIAL.println("\nPWSweather.com post data:");
    USE_SERIAL.println(postData);
    #ifdef SENDTOSITE
      USE_SERIAL.println(F("Sending..."));
      send2siteSecure(postSite3, PWSweatherSHA1, postData);
    #endif

    // -------------------- check for firmware updates FOTA --------------------
    if (doUpdateCheck) {
      updateCheck();
      doUpdateCheck = false;
    }

    // ==================== turn off wifi to save battery  =====================
    USE_SERIAL.print(F("Entering wifi sleep... "));
    WiFi.forceSleepBegin();
    delay(1000);
    USE_SERIAL.println("ok!");

    windSpeed = 0.0f;
    windSpeedSamplesCount = 0;

    windGust = 0.0f;
    windGustSamplesCount = 0;

    windPeak = 0.0f;
    windSpeedLastIntTime = 0;
    currentRainCount = 0;
    enableInterrupts();
  }

  // do this every hour:
  /*
  if (((millis() - count1h) >= 3600000) && (hourRainCount > 0)) {
    hourRain = 0.0f;
    hourRainCount = 0;
    count1h = millis();
  }
  */

  // do this every day:
  if (((millis() - count1d) >= (3600000*24)) && (dayRainCount > 0)) {
    dayRain = 0.0f;
    dayRainCount = 0;
    count1d = millis();
  }
}
